-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： localhost
-- 產生時間： 2025 年 11 月 12 日 01:30
-- 伺服器版本： 10.4.28-MariaDB
-- PHP 版本： 8.0.28

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `lamain`
--

-- --------------------------------------------------------

--
-- 資料表結構 `ramen_coupons`
--

CREATE TABLE `ramen_coupons` (
  `優惠券編號` int(11) NOT NULL COMMENT '優惠券編號',
  `電話` varchar(20) NOT NULL COMMENT '對應會員電話',
  `優惠券名稱` varchar(50) DEFAULT NULL COMMENT '優惠券名稱',
  `狀態` enum('未使用','已使用') DEFAULT '未使用' COMMENT '使用狀態',
  `到期日` date DEFAULT NULL COMMENT '到期日期',
  `建立時間` timestamp NOT NULL DEFAULT current_timestamp() COMMENT '建立時間',
  `領取時間` timestamp NOT NULL DEFAULT current_timestamp() COMMENT '兌換領取時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `ramen_coupons`
--

INSERT INTO `ramen_coupons` (`優惠券編號`, `電話`, `優惠券名稱`, `狀態`, `到期日`, `建立時間`, `領取時間`) VALUES
(1, '0933333333', '溏心蛋', '已使用', '2026-02-04', '2025-11-04 03:42:34', '2025-11-03 20:42:34'),
(4, '0900000000', '完善個人資料', '已使用', '2025-11-12', '2025-10-13 07:58:06', '2025-10-15 05:47:10'),
(6, '0900000000', '加麵', '未使用', '2026-01-15', '2025-10-15 05:56:59', '2025-10-14 23:56:59'),
(7, '0900000000', '首次入會', '已使用', '2025-11-14', '2025-10-15 05:57:46', '2025-10-15 05:57:46'),
(8, '0900000000', '加麵', '未使用', '2026-01-15', '2025-10-15 06:10:28', '2025-10-15 00:10:28'),
(9, '0933333333', '完善個人資料', '已使用', '2025-11-14', '2025-10-15 06:47:21', '2025-10-15 06:47:21'),
(10, '0933333333', '首次入會', '已使用', '2025-11-14', '2025-10-15 06:47:27', '2025-10-15 06:47:27'),
(26, '0933333333', '拉麵套餐', '未使用', '2026-01-16', '2025-10-16 05:23:55', '2025-10-15 23:23:55'),
(27, '0933333333', '加麵', '未使用', '2026-01-17', '2025-10-17 04:28:02', '2025-10-16 22:28:02'),
(28, '0933333333', '加麵', '未使用', '2026-01-20', '2025-10-20 04:59:29', '2025-10-19 22:59:29'),
(29, '0933333333', '加麵', '未使用', '2026-01-20', '2025-10-20 08:34:50', '2025-10-20 02:34:50'),
(30, '0900000000', '生日優惠', '已使用', '2025-11-29', '2025-10-30 05:09:27', '2025-10-30 05:09:27'),
(31, '0901123123', '完善個人資料', '已使用', '2025-11-30', '2025-10-31 00:53:23', '2025-10-31 00:53:23'),
(32, '0933333333', '加麵', '已使用', '2026-02-03', '2025-11-03 08:21:54', '2025-11-03 01:21:54'),
(33, '0933333333', '溏心蛋', '已使用', '2026-02-03', '2025-11-03 09:42:19', '2025-11-03 02:42:19');

-- --------------------------------------------------------

--
-- 資料表結構 `ramen_members`
--

CREATE TABLE `ramen_members` (
  `id` int(11) NOT NULL,
  `姓名` varchar(50) NOT NULL,
  `電話` varchar(20) NOT NULL,
  `密碼` varchar(255) NOT NULL,
  `Email` varchar(255) DEFAULT NULL,
  `生日` date DEFAULT NULL,
  `地址` text DEFAULT NULL,
  `會員點數` int(11) DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `驗證碼` varchar(6) DEFAULT NULL,
  `驗證碼建立時間` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `ramen_members`
--

INSERT INTO `ramen_members` (`id`, `姓名`, `電話`, `密碼`, `Email`, `生日`, `地址`, `會員點數`, `created_at`, `updated_at`, `驗證碼`, `驗證碼建立時間`) VALUES
(1, 'lkc', '0900000000', '$2y$10$rH9rdC1wLJkdAlnvpJcHM.cNg8C0hy3MJssVFpNFXgZElwnztY7WW', '123@gmail.com', '2000-06-06', '12233232332', 270, '2025-09-25 02:09:27', '2025-11-01 08:44:11', '415681', '2025-10-03 12:33:17'),
(2, '1', '0901123123', '$2y$10$AuHCxxXzMWYBhqr2wMpRheGFVC8qgbJkxfrKePneCQeU2/blJa/ju', NULL, '2025-09-04', NULL, 450, '2025-09-25 02:17:49', '2025-10-31 00:53:23', '778037', '2025-10-03 11:42:47'),
(3, '2', '0900789789', '$2y$10$gKzmJUjrkAt3a/9D9zRe9ejJHzaMyC7OfarfniFik.sW8iKjbIbA.', NULL, '2025-09-03', NULL, 0, '2025-09-26 02:03:48', '2025-10-05 12:40:35', NULL, NULL),
(4, '0', '0908000000', '$2y$10$aXH47b0/YNekjGORGo3UNuKpL7EQYfSj5G0mlEzNFT8tsLM8yovaa', NULL, '2025-09-06', NULL, 0, '2025-09-26 05:57:48', '2025-10-05 12:40:35', NULL, NULL),
(5, '4', '0988888888', '$2y$10$pEneZ/Xp8Thp4KVVY3ETWOeXPDvWVGSCuuWAIYK0WGpR1WCP2oYQm', NULL, '2025-09-04', NULL, 0, '2025-09-26 07:24:01', '2025-10-05 12:40:35', NULL, NULL),
(6, '123', '0900000001', '$2y$10$.a8hMj5H9MGbK2RHREgW2uo9x9Scfd55ZN/1b6DvOoGxAzxqZsjvu', NULL, '2025-10-16', NULL, 0, '2025-10-01 01:41:04', '2025-10-05 12:40:35', NULL, NULL),
(7, '567', '0911111111', '$2y$10$xCYQ6aP6NKN23u1M0m3Sd.KSfdjkriildI4p6cjK0UUoADkQc9P2e', NULL, '2025-10-04', NULL, 0, '2025-10-01 03:28:44', '2025-10-05 12:40:35', '914853', '2025-10-01 05:30:33'),
(8, 'y', '0977777777', '$2y$10$JDQe7J21ZctQLWBbP0w2ke02zW9ZEQm7qd.dVRIyq8I0jSmC1lQey', '1234@gmail.com', NULL, '12345', 50, '2025-10-13 08:28:56', '2025-10-13 08:30:49', NULL, NULL),
(11, '3', '0933333333', '$2y$10$k9Xs4iesblwQy2o1lIYhK.5mf1Ek.vdmfM0R0qY.4pHUe3rXGLwrW', '0303@gmail.com', '1999-08-02', NULL, 280, '2025-10-15 06:43:50', '2025-11-04 03:42:34', NULL, NULL),
(12, 'oo', '0978787787', '$2y$10$DkX1OkMMMK0n5/N/X7CmO.MVHr0SpEwsvOfvYb8qnEW65gWW6z4LS', NULL, '2025-11-06', NULL, 0, '2025-11-07 04:15:31', '2025-11-07 04:15:31', NULL, NULL),
(13, 'najaemin', '0981813813', '$2y$10$aLfZiNosVmYNsH91/PHNk.tJ7yDK7MzGymQuZXKSWAHStpmciwlYO', 'na@gmail.com', '2000-08-13', NULL, 0, '2025-11-07 04:34:26', '2025-11-07 04:34:26', NULL, NULL);

-- --------------------------------------------------------

--
-- 資料表結構 `ramen_orders`
--

CREATE TABLE `ramen_orders` (
  `訂單編號` varchar(20) NOT NULL COMMENT '訂單編號',
  `電話` varchar(20) NOT NULL COMMENT '對應會員電話',
  `訂單日期` date DEFAULT NULL COMMENT '訂單日期',
  `總金額` int(11) DEFAULT NULL COMMENT '訂單總金額',
  `獲得點數` int(11) DEFAULT 0 COMMENT '獲得點數',
  `商品明細` text DEFAULT NULL COMMENT '商品明細（JSON 或文字）',
  `建立時間` timestamp NOT NULL DEFAULT current_timestamp() COMMENT '建立時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `ramen_orders`
--

INSERT INTO `ramen_orders` (`訂單編號`, `電話`, `訂單日期`, `總金額`, `獲得點數`, `商品明細`, `建立時間`) VALUES
('ORD202510170001', '0933333333', '2025-10-17', 1200, 120, '拉麵三人豪華套餐', '2025-10-17 02:27:40'),
('ORD202510170002', '0933333333', '2025-10-25', 300, 30, '豚骨拉麵', '2025-10-25 02:17:12'),
('ORD202510170003', '0933333333', '2025-10-27', 300, 30, '醬油拉麵', '2025-10-28 02:17:12'),
('ORD202511050004', '0933333333', NULL, 750, 75, '[{\"id\":4,\"name\":\"叉燒拉麵\",\"price\":250,\"quantity\":3,\"points\":25}]', '2025-11-05 06:50:10'),
('ORD202511050005', '0933333333', NULL, 560, 56, '[{\"id\":7,\"name\":\"豚骨拉麵\",\"price\":280,\"quantity\":2,\"points\":28}]', '2025-11-05 06:57:54'),
('ORD202511050006', '0933333333', NULL, 400, 40, '[{\"id\":6,\"name\":\"醬油拉麵\",\"price\":200,\"quantity\":2,\"points\":20}]', '2025-11-05 07:12:38'),
('ORD202511060007', '0900000000', NULL, 60, 6, '[{\"id\":1,\"name\":\"溏心蛋\",\"price\":30,\"quantity\":2,\"points\":3}]', '2025-11-06 03:12:54'),
('ORD202511070008', '0900000000', NULL, 60, 6, '[{\"id\":1,\"name\":\"溏心蛋\",\"price\":30,\"quantity\":2,\"points\":3}]', '2025-11-07 01:46:34'),
('ORD202511070009', '0900000000', '2025-11-07', 30, 3, '溏心蛋 x1', '2025-11-07 01:47:26'),
('ORD202511070010', '0900000000', '2025-11-07', 40, 4, '加麵 x1', '2025-11-07 01:47:59'),
('ORD202511070011', '0900000000', '2025-11-07', 100, 10, '溏心蛋 x2, 加麵 x1', '2025-11-07 01:48:24'),
('ORD202511100012', '0933333333', '2025-11-10', 800, 80, '拉麵套餐 x2', '2025-11-10 08:28:19');

-- --------------------------------------------------------

--
-- 資料表結構 `ramen_rewards`
--

CREATE TABLE `ramen_rewards` (
  `優惠券編號` int(11) NOT NULL,
  `商品名稱` varchar(100) NOT NULL COMMENT '商品名稱',
  `需要點數` int(11) NOT NULL COMMENT '需要點數',
  `圖片` varchar(255) DEFAULT NULL COMMENT '商品圖片',
  `建立時間` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `ramen_rewards`
--

INSERT INTO `ramen_rewards` (`優惠券編號`, `商品名稱`, `需要點數`, `圖片`, `建立時間`) VALUES
(1, '溏心蛋', 30, 'assets/img/coupon-discount.jpg', '2025-10-15 02:44:45'),
(2, '加麵', 40, 'assets/img/coupon-extra-noodle.jpg', '2025-10-15 02:44:45'),
(3, '拉麵套餐', 400, 'assets/img/coupon-ramen-set.jpg', '2025-10-15 02:44:45');

-- --------------------------------------------------------

--
-- 資料表結構 `ynn`
--

CREATE TABLE `ynn` (
  `員工編號` varchar(10) DEFAULT NULL,
  `員工姓名` varchar(50) DEFAULT NULL,
  `员工帳號` varchar(50) DEFAULT NULL,
  `打卡日期` date DEFAULT NULL,
  `上下班時間` varchar(30) DEFAULT NULL,
  `打卡地點` varchar(100) DEFAULT NULL,
  `工作時數` varchar(20) DEFAULT NULL,
  `狀態` varchar(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `ynn`
--

INSERT INTO `ynn` (`員工編號`, `員工姓名`, `员工帳號`, `打卡日期`, `上下班時間`, `打卡地點`, `工作時數`, `狀態`) VALUES
('', '翁昆助', 'Kunchu', '2025-06-01', '09:39 ~ 21:50', '令和博多拉麵', '12小時10分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-01', '09:45 ~ 14:02', '令和博多拉麵', '4小時17分', ''),
('=\"960123\"', '李沛瑜', 'Yu', '2025-06-01', '11:58 ~ 16:00', '令和博多拉麵', '4小時1分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-01', '16:01 ~ 21:45', '令和博多拉麵', '5小時43分', ''),
('=\"980830\"', '謝佩均', 'Gina', '2025-06-01', '17:23 ~ 20:30', '令和博多拉麵', '3小時6分', ''),
('=\"960715\"', '林承諺', 'Chengyan', '2025-06-01', '17:59 ~ 21:50', '令和博多拉麵', '3小時51分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-02', '09:27 ~ 15:32', '令和博多拉麵', '6小時4分', ''),
('', '翁昆助', 'Kunchu', '2025-06-02', '09:41 ~ 14:30', '令和博多拉麵', '4小時48分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-02', '09:44 ~ 14:00', '令和博多拉麵', '4小時15分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-02', '10:00 ~ 14:00', '令和博多拉麵', '4小時', '補登'),
('=\"680828\"', '張簡千鈺', 'Ellie', '2025-06-02', '11:55 ~ 16:00', '令和博多拉麵', '4小時4分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-02', '16:00 ~ 22:00', '令和博多拉麵', '6小時', '補登'),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-02', '16:01 ~ 21:51', '令和博多拉麵', '5小時50分', ''),
('', '翁昆助', 'Kunchu', '2025-06-02', '16:20 ~ 21:49', '令和博多拉麵', '5小時29分', ''),
('=\"960715\"', '林承諺', 'Chengyan', '2025-06-02', '17:13 ~ 21:52', '令和博多拉麵', '4小時38分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-02', '17:21 ~ 21:39', '令和博多拉麵', '4小時17分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-03', '09:33 ~ 15:36', '令和博多拉麵', '6小時2分', ''),
('', '翁昆助', 'Kunchu', '2025-06-03', '09:40 ~ 14:31', '令和博多拉麵', '4小時51分', ''),
('=\"661102\"', '潘韋靜', 'Ching', '2025-06-03', '09:51 ~ 15:31', '令和博多拉麵', '5小時40分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-03', '10:00 ~ 21:45', '令和博多拉麵', '11小時45分', '補登'),
('', '翁昆助', 'Kunchu', '2025-06-03', '16:20 ~ 21:51', '令和博多拉麵', '5小時30分', ''),
('=\"661102\"', '潘韋靜', 'Ching', '2025-06-03', '16:25 ~ 22:06', '令和博多拉麵', '5小時40分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-03', '17:15 ~ 21:40', '令和博多拉麵', '4小時24分', ''),
('=\"950802\"', '鄭宇佳', 'Elena', '2025-06-03', '17:19 ~ 21:50', '令和博多拉麵', '4小時31分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-04', '09:32 ~ 21:49', '令和博多拉麵', '12小時17分', ''),
('', '翁昆助', 'Kunchu', '2025-06-04', '09:36 ~ 21:50', '令和博多拉麵', '12小時13分', ''),
('=\"661102\"', '潘韋靜', 'Ching', '2025-06-04', '09:51 ~ 14:00', '令和博多拉麵', '4小時8分', ''),
('=\"680828\"', '張簡千鈺', 'Ellie', '2025-06-04', '11:54 ~ 16:01', '令和博多拉麵', '4小時7分', ''),
('=\"661102\"', '潘韋靜', 'Ching', '2025-06-04', '15:57 ~ 22:08', '令和博多拉麵', '6小時11分', ''),
('=\"980830\"', '謝佩均', 'Gina', '2025-06-04', '17:00 ~ 22:02', '令和博多拉麵', '5小時1分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-05', '09:32 ~ 15:36', '令和博多拉麵', '6小時3分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-05', '09:47 ~ 14:01', '令和博多拉麵', '4小時13分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-05', '10:06 ~ 21:57', '令和博多拉麵', '11小時51分', ''),
('=\"661102\"', '潘韋靜', 'Ching', '2025-06-05', '11:53 ~ 16:01', '令和博多拉麵', '4小時8分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-05', '16:02 ~ 21:58', '令和博多拉麵', '5小時55分', ''),
('=\"960327\"', '游蕓安', 'Ann', '2025-06-05', '16:54 ~ 22:00', '令和博多拉麵', '5小時5分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-05', '17:06 ~ 21:52', '令和博多拉麵', '4小時45分', ''),
('=\"940910\"', '林宜伶', 'Ivysam', '2025-06-05', '17:32 ~ 20:26', '令和博多拉麵', '2小時54分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-06', '09:31 ~ 21:43', '令和博多拉麵', '12小時11分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-06', '09:42 ~ 14:00', '令和博多拉麵', '4小時17分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-06', '10:22 ~ 21:45', '令和博多拉麵', '11小時22分', ''),
('=\"680828\"', '張簡千鈺', 'Ellie', '2025-06-06', '11:55 ~ 16:00', '令和博多拉麵', '4小時5分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-06', '15:58 ~ 22:22', '令和博多拉麵', '6小時24分', ''),
('=\"960715\"', '林承諺', 'Chengyan', '2025-06-06', '17:28 ~ 20:44', '令和博多拉麵', '3小時16分', ''),
('=\"950802\"', '鄭宇佳', 'Elena', '2025-06-06', '17:59 ~ 21:48', '令和博多拉麵', '3小時48分', ''),
('=\"710705\"', '涂瀞鄉', 'Doreen', '2025-06-06', '19:01 ~ 23:07', '令和博多拉麵', '4小時6分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-07', '09:34 ~ 15:30', '令和博多拉麵', '5小時56分', ''),
('', '翁昆助', 'Kunchu', '2025-06-07', '09:38 ~ 14:30', '令和博多拉麵', '4小時51分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-07', '09:45 ~ 14:05', '令和博多拉麵', '4小時20分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-07', '10:12 ~ 21:38', '令和博多拉麵', '11小時25分', ''),
('=\"960327\"', '游蕓安', 'Ann', '2025-06-07', '11:53 ~ 16:02', '令和博多拉麵', '4小時8分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-07', '15:56 ~ 22:00', '令和博多拉麵', '6小時3分', ''),
('', '翁昆助', 'Kunchu', '2025-06-07', '16:23 ~ 21:38', '令和博多拉麵', '5小時15分', ''),
('=\"960327\"', '游蕓安', 'Ann', '2025-06-07', '17:29 ~ 20:31', '令和博多拉麵', '3小時1分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-07', '17:40 ~ 21:30', '令和博多拉麵', '3小時49分', ''),
('=\"960715\"', '林承諺', 'Chengyan', '2025-06-07', '17:59 ~ 22:00', '令和博多拉麵', '4小時1分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-08', '09:32 ~ 15:29', '令和博多拉麵', '5小時57分', ''),
('', '翁昆助', 'Kunchu', '2025-06-08', '09:38 ~ 14:30', '令和博多拉麵', '4小時52分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-08', '09:41 ~ 14:00', '令和博多拉麵', '4小時18分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-08', '10:08 ~ 13:31', '令和博多拉麵', '3小時22分', ''),
('=\"980830\"', '謝佩均', 'Gina', '2025-06-08', '11:57 ~ 16:10', '令和博多拉麵', '4小時13分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-08', '15:26 ~ 21:44', '令和博多拉麵', '6小時18分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-08', '15:59 ~ 21:46', '令和博多拉麵', '5小時47分', ''),
('', '翁昆助', 'Kunchu', '2025-06-08', '16:21 ~ 21:46', '令和博多拉麵', '5小時24分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-08', '17:21 ~ 21:44', '令和博多拉麵', '4小時23分', ''),
('=\"960123\"', '李沛瑜', 'Yu', '2025-06-08', '17:29 ~ 20:31', '令和博多拉麵', '3小時1分', ''),
('=\"960715\"', '林承諺', 'Chengyan', '2025-06-08', '17:51 ~ 21:47', '令和博多拉麵', '3小時55分', ''),
('', '翁昆助', 'Kunchu', '2025-06-09', '09:26 ~ 22:10', '令和博多拉麵', '12小時44分', ''),
('=\"661102\"', '潘韋靜', 'Ching', '2025-06-09', '09:50 ~ 14:02', '令和博多拉麵', '4小時11分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-09', '10:09 ~ 22:10', '令和博多拉麵', '12小時1分', ''),
('=\"710705\"', '涂瀞鄉', 'Doreen', '2025-06-09', '10:29 ~ 14:39', '令和博多拉麵', '4小時9分', ''),
('=\"680828\"', '張簡千鈺', 'Ellie', '2025-06-09', '11:53 ~ 16:01', '令和博多拉麵', '4小時8分', ''),
('=\"661102\"', '潘韋靜', 'Ching', '2025-06-09', '15:55 ~ 22:11', '令和博多拉麵', '6小時15分', ''),
('=\"960715\"', '林承諺', 'Chengyan', '2025-06-09', '16:58 ~ 22:12', '令和博多拉麵', '5小時14分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-10', '09:33 ~ 14:37', '令和博多拉麵', '5小時4分', ''),
('', '翁昆助', 'Kunchu', '2025-06-10', '09:40 ~ 14:32', '令和博多拉麵', '4小時52分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-10', '09:41 ~ 14:02', '令和博多拉麵', '4小時20分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-10', '10:03 ~ 21:41', '令和博多拉麵', '11小時37分', ''),
('=\"661102\"', '潘韋靜', 'Ching', '2025-06-10', '11:52 ~ 16:41', '令和博多拉麵', '4小時48分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-10', '16:02 ~ 21:38', '令和博多拉麵', '5小時35分', ''),
('', '翁昆助', 'Kunchu', '2025-06-10', '16:20 ~ 21:41', '令和博多拉麵', '5小時20分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-10', '16:47 ~ 21:32', '令和博多拉麵', '4小時45分', ''),
('=\"980830\"', '謝佩均', 'Gina', '2025-06-10', '17:16 ~ 21:36', '令和博多拉麵', '4小時20分', ''),
('=\"950802\"', '鄭宇佳', 'Elena', '2025-06-10', '17:59 ~ 20:01', '令和博多拉麵', '2小時2分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-11', '09:25 ~ 21:51', '令和博多拉麵', '12小時26分', ''),
('', '翁昆助', 'Kunchu', '2025-06-11', '09:36 ~ 21:57', '令和博多拉麵', '12小時20分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-11', '09:47 ~ 14:00', '令和博多拉麵', '4小時12分', ''),
('=\"680828\"', '張簡千鈺', 'Ellie', '2025-06-11', '11:55 ~ 16:00', '令和博多拉麵', '4小時5分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-11', '15:59 ~ 22:06', '令和博多拉麵', '6小時7分', ''),
('=\"960715\"', '林承諺', 'Chengyan', '2025-06-11', '17:00 ~ 22:07', '令和博多拉麵', '5小時6分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-12', '09:25 ~ 21:26', '令和博多拉麵', '12小時', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-12', '09:50 ~ 14:04', '令和博多拉麵', '4小時14分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-12', '10:29 ~ 21:25', '令和博多拉麵', '10小時56分', ''),
('=\"661102\"', '潘韋靜', 'Ching', '2025-06-12', '11:52 ~ 16:01', '令和博多拉麵', '4小時9分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-12', '16:01 ~ 21:45', '令和博多拉麵', '5小時44分', ''),
('=\"980830\"', '謝佩均', 'Gina', '2025-06-12', '16:59 ~ 21:45', '令和博多拉麵', '4小時45分', ''),
('', '翁昆助', 'Kunchu', '2025-06-13', '09:30 ~ 21:59', '令和博多拉麵', '12小時28分', ''),
('=\"661102\"', '潘韋靜', 'Ching', '2025-06-13', '09:55 ~ 14:01', '令和博多拉麵', '4小時5分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-13', '10:34 ~ 21:41', '令和博多拉麵', '11小時6分', ''),
('=\"680828\"', '張簡千鈺', 'Ellie', '2025-06-13', '11:56 ~ 16:01', '令和博多拉麵', '4小時4分', ''),
('=\"950802\"', '鄭宇佳', 'Elena', '2025-06-13', '16:01 ~ 22:02', '令和博多拉麵', '6小時1分', ''),
('=\"960715\"', '林承諺', 'Chengyan', '2025-06-13', '16:58 ~ 22:03', '令和博多拉麵', '5小時5分', ''),
('', '翁昆助', 'Kunchu', '2025-06-14', '09:18 ~ 21:54', '令和博多拉麵', '12小時36分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-14', '09:32 ~ 21:47', '令和博多拉麵', '12小時14分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-14', '09:41 ~ 14:03', '令和博多拉麵', '4小時21分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-14', '10:15 ~ 21:45', '令和博多拉麵', '11小時30分', ''),
('=\"960327\"', '游蕓安', 'Ann', '2025-06-14', '12:02 ~ 16:00', '令和博多拉麵', '3小時58分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-14', '16:02 ~ 21:57', '令和博多拉麵', '5小時54分', ''),
('=\"960327\"', '游蕓安', 'Ann', '2025-06-14', '17:28 ~ 20:30', '令和博多拉麵', '3小時1分', ''),
('=\"950802\"', '鄭宇佳', 'Elena', '2025-06-14', '18:01 ~ 22:00', '令和博多拉麵', '3小時58分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-15', '09:36 ~ 14:31', '令和博多拉麵', '4小時54分', ''),
('', '翁昆助', 'Kunchu', '2025-06-15', '09:38 ~ 14:30', '令和博多拉麵', '4小時52分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-15', '09:41 ~ 14:00', '令和博多拉麵', '4小時18分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-15', '10:06 ~ 16:22', '令和博多拉麵', '6小時15分', ''),
('=\"980830\"', '謝佩均', 'Gina', '2025-06-15', '11:56 ~ 16:00', '令和博多拉麵', '4小時3分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-15', '15:59 ~ 22:00', '令和博多拉麵', '6小時', ''),
('', '翁昆助', 'Kunchu', '2025-06-15', '16:20 ~ 21:49', '令和博多拉麵', '5小時29分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-15', '16:20 ~ 21:43', '令和博多拉麵', '5小時23分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-15', '16:53 ~ 21:48', '令和博多拉麵', '4小時55分', ''),
('=\"980830\"', '謝佩均', 'Gina', '2025-06-15', '17:30 ~ 20:30', '令和博多拉麵', '2小時59分', ''),
('=\"710705\"', '涂瀞鄉', 'Doreen', '2025-06-15', '17:57 ~ 22:08', '令和博多拉麵', '4小時10分', ''),
('=\"950802\"', '鄭宇佳', 'Elena', '2025-06-15', '18:06 ~ 22:05', '令和博多拉麵', '3小時59分', ''),
('', '翁昆助', 'Kunchu', '2025-06-16', '09:10 ~ 21:56', '令和博多拉麵', '12小時45分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-16', '09:43 ~ 14:04', '令和博多拉麵', '4小時21分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-16', '10:13 ~ 21:52', '令和博多拉麵', '11小時38分', ''),
('=\"680828\"', '張簡千鈺', 'Ellie', '2025-06-16', '11:56 ~ 16:01', '令和博多拉麵', '4小時5分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-16', '15:52 ~ 21:47', '令和博多拉麵', '5小時55分', ''),
('=\"661102\"', '潘韋靜', 'Ching', '2025-06-16', '16:43 ~ 22:01', '令和博多拉麵', '5小時17分', ''),
('=\"710705\"', '涂瀞鄉', 'Doreen', '2025-06-16', '18:06 ~ 21:25', '令和博多拉麵', '3小時18分', ''),
('', '翁昆助', 'Kunchu', '2025-06-17', '08:54 ~ 14:30', '令和博多拉麵', '5小時35分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-17', '09:30 ~ 14:36', '令和博多拉麵', '5小時5分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-17', '09:48 ~ 14:00', '令和博多拉麵', '4小時11分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-17', '10:49 ~ 21:41', '令和博多拉麵', '10小時52分', ''),
('=\"661102\"', '潘韋靜', 'Ching', '2025-06-17', '11:44 ~ 16:07', '令和博多拉麵', '4小時22分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-17', '15:58 ~ 21:42', '令和博多拉麵', '5小時43分', ''),
('', '翁昆助', 'Kunchu', '2025-06-17', '16:24 ~ 21:36', '令和博多拉麵', '5小時11分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-17', '16:24 ~ 21:29', '令和博多拉麵', '5小時5分', ''),
('=\"940910\"', '林宜伶', 'Ivysam', '2025-06-17', '17:57 ~ 22:02', '令和博多拉麵', '4小時4分', ''),
('=\"710705\"', '涂瀞鄉', 'Doreen', '2025-06-17', '19:44 ~ 19:45', '令和博多拉麵', '', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-18', '09:26 ~ 21:41', '令和博多拉麵', '12小時14分', ''),
('', '翁昆助', 'Kunchu', '2025-06-18', '09:30 ~ 21:52', '令和博多拉麵', '12小時21分', ''),
('=\"661102\"', '潘韋靜', 'Ching', '2025-06-18', '09:49 ~ 14:01', '令和博多拉麵', '4小時12分', ''),
('=\"710705\"', '涂瀞鄉', 'Doreen', '2025-06-18', '11:00 ~ 22:01', '令和博多拉麵', '11小時1分', ''),
('=\"680828\"', '張簡千鈺', 'Ellie', '2025-06-18', '11:54 ~ 16:03', '令和博多拉麵', '4小時9分', ''),
('=\"661102\"', '潘韋靜', 'Ching', '2025-06-18', '15:55 ~ 22:00', '令和博多拉麵', '6小時5分', ''),
('=\"950802\"', '鄭宇佳', 'Elena', '2025-06-18', '16:59 ~ 22:01', '令和博多拉麵', '5小時2分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-19', '09:32 ~ 21:30', '令和博多拉麵', '11小時58分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-19', '09:41 ~ 14:00', '令和博多拉麵', '4小時18分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-19', '10:15 ~ 21:38', '令和博多拉麵', '11小時23分', ''),
('=\"680828\"', '張簡千鈺', 'Ellie', '2025-06-19', '10:55 ~ 16:01', '令和博多拉麵', '5小時5分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-19', '15:56 ~ 21:47', '令和博多拉麵', '5小時51分', ''),
('=\"950802\"', '鄭宇佳', 'Elena', '2025-06-19', '17:00 ~ 21:47', '令和博多拉麵', '4小時47分', ''),
('=\"940910\"', '林宜伶', 'Ivysam', '2025-06-19', '18:05 ~ 20:15', '令和博多拉麵', '2小時10分', ''),
('', '翁昆助', 'Kunchu', '2025-06-20', '09:33 ~ 14:30', '令和博多拉麵', '4小時56分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-20', '09:33 ~ 14:33', '令和博多拉麵', '4小時59分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-20', '09:51 ~ 14:00', '令和博多拉麵', '4小時9分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-20', '10:22 ~ 22:01', '令和博多拉麵', '11小時39分', ''),
('=\"661102\"', '潘韋靜', 'Ching', '2025-06-20', '11:45 ~ 16:09', '令和博多拉麵', '4小時23分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-20', '15:59 ~ 22:04', '令和博多拉麵', '6小時4分', ''),
('', '翁昆助', 'Kunchu', '2025-06-20', '16:20 ~ 22:01', '令和博多拉麵', '5小時41分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-20', '16:27 ~ 21:48', '令和博多拉麵', '5小時21分', ''),
('=\"960123\"', '李沛瑜', 'Yu', '2025-06-20', '17:29 ~ 20:31', '令和博多拉麵', '3小時1分', ''),
('=\"960715\"', '林承諺', 'Chengyan', '2025-06-20', '18:00 ~ 22:05', '令和博多拉麵', '4小時4分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-21', '09:38 ~ 14:56', '令和博多拉麵', '5小時17分', ''),
('', '翁昆助', 'Kunchu', '2025-06-21', '09:40 ~ 14:36', '令和博多拉麵', '4小時56分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-21', '09:51 ~ 14:08', '令和博多拉麵', '4小時17分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-21', '10:26 ~ 21:36', '令和博多拉麵', '11小時9分', ''),
('=\"960327\"', '游蕓安', 'Ann', '2025-06-21', '11:53 ~ 16:01', '令和博多拉麵', '4小時7分', ''),
('=\"710705\"', '涂瀞鄉', 'Doreen', '2025-06-21', '15:52 ~ 22:00', '令和博多拉麵', '6小時8分', '修改'),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-21', '16:00 ~ 21:40', '令和博多拉麵', '5小時39分', ''),
('', '翁昆助', 'Kunchu', '2025-06-21', '16:20 ~ 21:42', '令和博多拉麵', '5小時21分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-21', '16:37 ~ 21:28', '令和博多拉麵', '4小時51分', ''),
('=\"960327\"', '游蕓安', 'Ann', '2025-06-21', '17:28 ~ 20:31', '令和博多拉麵', '3小時2分', ''),
('=\"960715\"', '林承諺', 'Chengyan', '2025-06-21', '17:44 ~ 21:45', '令和博多拉麵', '4小時', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-22', '09:33 ~ 21:38', '令和博多拉麵', '12小時5分', ''),
('', '翁昆助', 'Kunchu', '2025-06-22', '09:38 ~ 21:43', '令和博多拉麵', '12小時4分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-22', '09:45 ~ 14:00', '令和博多拉麵', '4小時15分', ''),
('=\"980830\"', '謝佩均', 'Gina', '2025-06-22', '11:56 ~ 16:00', '令和博多拉麵', '4小時3分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-22', '15:59 ~ 22:00', '令和博多拉麵', '6小時1分', '修改'),
('=\"960123\"', '李沛瑜', 'Yu', '2025-06-22', '17:28 ~ 20:30', '令和博多拉麵', '3小時2分', ''),
('=\"960715\"', '林承諺', 'Chengyan', '2025-06-22', '17:44 ~ 21:45', '令和博多拉麵', '4小時', ''),
('', '翁昆助', 'Kunchu', '2025-06-23', '09:27 ~ 21:50', '令和博多拉麵', '12小時23分', ''),
('=\"661102\"', '潘韋靜', 'Ching', '2025-06-23', '09:50 ~ 14:06', '令和博多拉麵', '4小時16分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-23', '10:13 ~ 21:51', '令和博多拉麵', '11小時38分', ''),
('=\"680828\"', '張簡千鈺', 'Ellie', '2025-06-23', '11:55 ~ 16:01', '令和博多拉麵', '4小時5分', ''),
('=\"661102\"', '潘韋靜', 'Ching', '2025-06-23', '15:53 ~ 22:02', '令和博多拉麵', '6小時9分', ''),
('=\"960715\"', '林承諺', 'Chengyan', '2025-06-23', '16:57 ~ 22:02', '令和博多拉麵', '5小時4分', ''),
('=\"980830\"', '謝佩均', 'Gina', '2025-06-23', '17:56 ~ 20:01', '令和博多拉麵', '2小時4分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-24', '09:35 ~ 14:31', '令和博多拉麵', '4小時56分', ''),
('', '翁昆助', 'Kunchu', '2025-06-24', '09:40 ~ 14:30', '令和博多拉麵', '4小時50分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-24', '09:44 ~ 14:00', '令和博多拉麵', '4小時15分', ''),
('=\"680828\"', '張簡千鈺', 'Ellie', '2025-06-24', '09:54 ~ 16:00', '令和博多拉麵', '6小時5分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-24', '10:30 ~ 21:23', '令和博多拉麵', '10小時53分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-24', '16:00 ~ 21:46', '令和博多拉麵', '5小時46分', ''),
('', '翁昆助', 'Kunchu', '2025-06-24', '16:20 ~ 21:46', '令和博多拉麵', '5小時26分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-24', '16:29 ~ 21:27', '令和博多拉麵', '4小時57分', ''),
('=\"960715\"', '林承諺', 'Chengyan', '2025-06-24', '16:58 ~ 21:46', '令和博多拉麵', '4小時47分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-25', '09:24 ~ 21:26', '令和博多拉麵', '12小時2分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-25', '09:51 ~ 14:05', '令和博多拉麵', '4小時14分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-25', '10:18 ~ 21:17', '令和博多拉麵', '10小時59分', ''),
('=\"680828\"', '張簡千鈺', 'Ellie', '2025-06-25', '10:54 ~ 16:00', '令和博多拉麵', '5小時5分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-25', '16:04 ~ 21:43', '令和博多拉麵', '5小時38分', ''),
('=\"980830\"', '謝佩均', 'Gina', '2025-06-25', '16:55 ~ 21:45', '令和博多拉麵', '4小時50分', ''),
('=\"960123\"', '李沛瑜', 'Yu', '2025-06-25', '17:59 ~ 20:00', '令和博多拉麵', '2小時', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-26', '09:32 ~ 15:12', '令和博多拉麵', '5小時39分', ''),
('', '翁昆助', 'Kunchu', '2025-06-26', '09:34 ~ 14:39', '令和博多拉麵', '5小時4分', ''),
('=\"661102\"', '潘韋靜', 'Ching', '2025-06-26', '09:50 ~ 14:37', '令和博多拉麵', '4小時47分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-26', '10:22 ~ 22:00', '令和博多拉麵', '11小時38分', ''),
('=\"960327\"', '游蕓安', 'Ann', '2025-06-26', '11:53 ~ 16:00', '令和博多拉麵', '4小時6分', ''),
('=\"661102\"', '潘韋靜', 'Ching', '2025-06-26', '15:56 ~ 22:00', '令和博多拉麵', '6小時3分', ''),
('', '翁昆助', 'Kunchu', '2025-06-26', '16:23 ~ 21:58', '令和博多拉麵', '5小時34分', ''),
('=\"960715\"', '林承諺', 'Chengyan', '2025-06-26', '16:24 ~ 22:00', '令和博多拉麵', '5小時35分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-26', '16:45 ~ 21:50', '令和博多拉麵', '5小時5分', ''),
('', '翁昆助', 'Kunchu', '2025-06-27', '09:35 ~ 21:52', '令和博多拉麵', '12小時16分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-27', '09:46 ~ 14:00', '令和博多拉麵', '4小時13分', ''),
('=\"661102\"', '潘韋靜', 'Ching', '2025-06-27', '11:57 ~ 16:00', '令和博多拉麵', '4小時2分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-27', '15:59 ~ 21:57', '令和博多拉麵', '5小時58分', ''),
('=\"960823\"', '劉季嫻', 'Fifi', '2025-06-27', '17:30 ~ 20:30', '令和博多拉麵', '3小時', '補登'),
('=\"980830\"', '謝佩均', 'Gina', '2025-06-27', '17:56 ~ 22:00', '令和博多拉麵', '4小時3分', ''),
('=\"420305\"', '郭再興', 'Kuo', '2025-06-28', '09:27 ~ 21:30', '令和博多拉麵', '12小時2分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-28', '09:51 ~ 14:02', '令和博多拉麵', '4小時10分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-28', '10:04 ~ 21:42', '令和博多拉麵', '11小時38分', ''),
('=\"950802\"', '鄭宇佳', 'Elena', '2025-06-28', '12:11 ~ 16:17', '令和博多拉麵', '4小時5分', ''),
('=\"960823\"', '劉季嫻', 'Fifi', '2025-06-28', '14:32 ~ 20:32', '令和博多拉麵', '6小時', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-28', '16:00 ~ 21:45', '令和博多拉麵', '5小時44分', ''),
('=\"950802\"', '鄭宇佳', 'Elena', '2025-06-28', '17:59 ~ 22:03', '令和博多拉麵', '4小時4分', ''),
('', '翁昆助', 'Kunchu', '2025-06-29', '09:31 ~ 22:03', '令和博多拉麵', '12小時32分', ''),
('=\"960715\"', '林承諺', 'Chengyan', '2025-06-29', '09:52 ~ 14:11', '令和博多拉麵', '4小時18分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-29', '10:08 ~ 22:08', '令和博多拉麵', '11小時59分', ''),
('=\"960123\"', '李沛瑜', 'Yu', '2025-06-29', '11:59 ~ 16:00', '令和博多拉麵', '4小時', ''),
('=\"960715\"', '林承諺', 'Chengyan', '2025-06-29', '15:59 ~ 22:12', '令和博多拉麵', '6小時13分', ''),
('=\"960123\"', '李沛瑜', 'Yu', '2025-06-29', '17:29 ~ 20:30', '令和博多拉麵', '3小時', ''),
('=\"980830\"', '謝佩均', 'Gina', '2025-06-29', '17:56 ~ 22:12', '令和博多拉麵', '4小時16分', ''),
('', '翁昆助', 'Kunchu', '2025-06-30', '09:17 ~ 21:49', '令和博多拉麵', '12小時32分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-30', '09:41 ~ 14:05', '令和博多拉麵', '4小時24分', ''),
('=\"830622\"', '于家翔', 'Xiang', '2025-06-30', '10:21 ~ 21:50', '令和博多拉麵', '11小時28分', ''),
('=\"661102\"', '潘韋靜', 'Ching', '2025-06-30', '11:57 ~ 16:03', '令和博多拉麵', '4小時6分', ''),
('=\"960715\"', '林承諺', 'Chengyan', '2025-06-30', '12:57 ~ 16:03', '令和博多拉麵', '3小時5分', ''),
('=\"890819\"', '邱耀賢', 'Andy', '2025-06-30', '16:02 ~ 21:48', '令和博多拉麵', '5小時45分', ''),
('=\"980830\"', '謝佩均', 'Gina', '2025-06-30', '16:56 ~ 22:00', '令和博多拉麵', '5小時3分', ''),
('=\"960823\"', '劉季嫻', 'Fifi', '2025-06-30', '17:59 ~ 20:05', '令和博多拉麵', '2小時6分', '');

-- --------------------------------------------------------

--
-- 資料表結構 `員工基本資料`
--

CREATE TABLE `員工基本資料` (
  `id` int(11) NOT NULL,
  `name` text NOT NULL COMMENT '姓名',
  `birth_date` date DEFAULT NULL,
  `role` text NOT NULL COMMENT '雇用類別',
  `Position` varchar(20) NOT NULL COMMENT '職位名稱',
  `base_salary` int(11) DEFAULT NULL,
  `hourly_rate` int(11) DEFAULT NULL,
  `Telephone` varchar(20) NOT NULL COMMENT '電話',
  `address` varchar(100) NOT NULL COMMENT '地址',
  `ID_card` varchar(20) NOT NULL COMMENT '身分證',
  `account` varchar(20) NOT NULL COMMENT '登入帳號',
  `password` varchar(20) NOT NULL COMMENT '密碼'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `員工基本資料`
--

INSERT INTO `員工基本資料` (`id`, `name`, `birth_date`, `role`, `Position`, `base_salary`, `hourly_rate`, `Telephone`, `address`, `ID_card`, `account`, `password`) VALUES
(1013, '林依玲', '2003-09-04', '正職', 'ffffffffffff', 39000, NULL, '0988765565', '新北市新店區安安路55巷5號5樓', 'h334523455', 'staff@1013', 'h334523455'),
(1016, '胡瓜瓜', '2025-07-21', '臨時員工', '主廚', NULL, 200, '0947534756', '台北市內湖區刮刮路123號4樓', 'h123456789', 'staff@1016', 'h123456789'),
(1017, '寶佳醫', '2005-03-21', '正職', '外場', 27800, NULL, '0947539992', '台北市內湖區刮刮路13號8樓', 'a888887766', 'staff@1017', 'a888887766'),
(1018, 'gggg', '2025-06-30', '臨時員工', 'ggg', NULL, 200, '0947539992', '台北市內湖區刮刮路13號8樓', 'h443567566', 'staff@1018', 'h443567566'),
(1019, 'hhhh', '1996-01-10', '臨時員工', '外場', NULL, 200, '0922314543', '台北市內湖區刮刮路2號11樓', 'f334523455', 'staff@1019', 'f334523455'),
(1020, 'hh', '2025-07-17', '臨時員工', '外場', NULL, 200, '0988475637', '台北市內湖區刮刮路13號8樓', 'f223456455', 'staff@1020', 'f223456455'),
(1021, 'hhhh', '2025-07-17', '臨時員工', '外場', NULL, 200, '0988475637', '台北市內湖區刮刮路13號8樓', 'f223456455', 'staff@1021', 'f223456455');

-- --------------------------------------------------------

--
-- 資料表結構 `庫存管理`
--

CREATE TABLE `庫存管理` (
  `id` int(11) NOT NULL COMMENT '編號',
  `item_name` varchar(20) NOT NULL COMMENT '品項名稱',
  `category` varchar(20) NOT NULL COMMENT '類別',
  `quantity` int(11) NOT NULL COMMENT '現有庫存數量',
  `unit` varchar(20) NOT NULL COMMENT '單位',
  `last_update` decimal(10,0) NOT NULL COMMENT '進貨時間',
  `updated_by` int(11) NOT NULL COMMENT '進貨人'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- 資料表結構 `打卡紀錄`
--

CREATE TABLE `打卡紀錄` (
  `id` int(20) NOT NULL COMMENT '編號',
  `user_id` int(20) NOT NULL COMMENT '員工ID',
  `clock_in` datetime NOT NULL COMMENT '上班打卡時間',
  `clock_out` datetime NOT NULL COMMENT '下班打卡時間',
  `hours` float NOT NULL COMMENT '工時（可由系統計算）',
  `status` varchar(50) NOT NULL COMMENT '(''正常'', ''遲到'', ''早退'', ''缺卡'')'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- 資料表結構 `日報表`
--

CREATE TABLE `日報表` (
  `id` int(11) NOT NULL COMMENT '日報表編號',
  `report_date` date NOT NULL COMMENT '報表日期',
  `weekday` varchar(10) NOT NULL COMMENT '星期幾',
  `filled_by` int(11) NOT NULL COMMENT '填表人',
  `cash_income` int(11) NOT NULL COMMENT '現金收入',
  `linepay_income` int(11) NOT NULL COMMENT 'Line Pay 收入',
  `uber_income` int(11) NOT NULL COMMENT 'Uber Eats 收入',
  `other_income` int(11) NOT NULL COMMENT '其他收入',
  `total_income` int(11) NOT NULL COMMENT '收入合計',
  `total_expense` int(11) NOT NULL COMMENT '支出合計',
  `cash_1000` int(11) NOT NULL COMMENT '店內現金 1000 張數',
  `cash_500` int(11) NOT NULL COMMENT '店內現金 500 張數',
  `cash_100` int(11) NOT NULL COMMENT '店內現金 100 張數',
  `cash_50` int(11) NOT NULL COMMENT '店內現金 50 枚數',
  `cash_10` int(11) NOT NULL COMMENT '店內現金 10 枚數',
  `cash_5` int(11) NOT NULL COMMENT '店內現金 5 枚數',
  `cash_1` int(11) NOT NULL COMMENT '店內現金 1 枚數',
  `cash_total` int(11) NOT NULL COMMENT '店內現金總額（可自動計）',
  `deposit_to_bank` int(11) NOT NULL COMMENT '當日存入銀行金額',
  `created_at` datetime NOT NULL COMMENT '建立時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- 資料表結構 `班表`
--

CREATE TABLE `班表` (
  `id` int(11) NOT NULL COMMENT '班表編號',
  `user_id` int(11) NOT NULL COMMENT '員工 ID',
  `work_date` date NOT NULL COMMENT '班表日期',
  `start_time` time NOT NULL COMMENT '開始時間',
  `end_time` time NOT NULL COMMENT '結束時間',
  `shift_type` varchar(50) NOT NULL COMMENT '（中午、晚班等）',
  `note` varchar(50) NOT NULL COMMENT '備註，例如「代班」「外場」等'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- 資料表結構 `薪資`
--

CREATE TABLE `薪資` (
  `id` varchar(20) NOT NULL COMMENT '員工編號',
  `name` varchar(20) NOT NULL COMMENT '姓名',
  `salary_month` int(11) NOT NULL COMMENT '發薪月份',
  `base_salary` int(20) NOT NULL COMMENT '底薪',
  `working_hours` int(20) NOT NULL COMMENT '時數'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `ramen_coupons`
--
ALTER TABLE `ramen_coupons`
  ADD PRIMARY KEY (`優惠券編號`),
  ADD KEY `fk_優惠券會員` (`電話`);

--
-- 資料表索引 `ramen_members`
--
ALTER TABLE `ramen_members`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `電話` (`電話`),
  ADD UNIQUE KEY `unique_phone` (`電話`);

--
-- 資料表索引 `ramen_orders`
--
ALTER TABLE `ramen_orders`
  ADD PRIMARY KEY (`訂單編號`),
  ADD KEY `fk_會員電話` (`電話`);

--
-- 資料表索引 `ramen_rewards`
--
ALTER TABLE `ramen_rewards`
  ADD PRIMARY KEY (`優惠券編號`);

--
-- 資料表索引 `員工基本資料`
--
ALTER TABLE `員工基本資料`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `庫存管理`
--
ALTER TABLE `庫存管理`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `打卡紀錄`
--
ALTER TABLE `打卡紀錄`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `日報表`
--
ALTER TABLE `日報表`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `薪資`
--
ALTER TABLE `薪資`
  ADD PRIMARY KEY (`id`,`salary_month`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `ramen_coupons`
--
ALTER TABLE `ramen_coupons`
  MODIFY `優惠券編號` int(11) NOT NULL AUTO_INCREMENT COMMENT '優惠券編號', AUTO_INCREMENT=34;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `ramen_members`
--
ALTER TABLE `ramen_members`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `員工基本資料`
--
ALTER TABLE `員工基本資料`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1022;

--
-- 已傾印資料表的限制式
--

--
-- 資料表的限制式 `ramen_coupons`
--
ALTER TABLE `ramen_coupons`
  ADD CONSTRAINT `fk_優惠券會員` FOREIGN KEY (`電話`) REFERENCES `ramen_members` (`電話`);

--
-- 資料表的限制式 `ramen_orders`
--
ALTER TABLE `ramen_orders`
  ADD CONSTRAINT `fk_會員電話` FOREIGN KEY (`電話`) REFERENCES `ramen_members` (`電話`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
