-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： localhost
-- 產生時間： 2025 年 12 月 08 日 09:38
-- 伺服器版本： 10.4.28-MariaDB
-- PHP 版本： 8.0.28

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `lamain`
--

-- --------------------------------------------------------

--
-- 資料表結構 `ramen_coupons`
--

CREATE TABLE `ramen_coupons` (
  `優惠券編號` int(11) NOT NULL COMMENT '優惠券編號',
  `電話` varchar(20) NOT NULL COMMENT '對應會員電話',
  `優惠券名稱` varchar(50) DEFAULT NULL COMMENT '優惠券名稱',
  `狀態` enum('未使用','已使用') DEFAULT '未使用' COMMENT '使用狀態',
  `到期日` date DEFAULT NULL COMMENT '到期日期',
  `建立時間` timestamp NOT NULL DEFAULT current_timestamp() COMMENT '建立時間',
  `領取時間` timestamp NOT NULL DEFAULT current_timestamp() COMMENT '兌換領取時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `ramen_coupons`
--

INSERT INTO `ramen_coupons` (`優惠券編號`, `電話`, `優惠券名稱`, `狀態`, `到期日`, `建立時間`, `領取時間`) VALUES
(1, '0933333333', '溏心蛋', '已使用', '2026-02-04', '2025-11-04 03:42:34', '2025-11-03 20:42:34'),
(2, '0909090909', '加麵', '已使用', '2026-02-14', '2025-11-14 05:30:41', '2025-11-13 22:30:41'),
(4, '0900000000', '完善個人資料', '已使用', '2025-11-12', '2025-10-13 07:58:06', '2025-10-15 05:47:10'),
(6, '0900000000', '加麵', '未使用', '2026-01-15', '2025-10-15 05:56:59', '2025-10-14 23:56:59'),
(7, '0900000000', '首次入會', '已使用', '2025-11-14', '2025-10-15 05:57:46', '2025-10-15 05:57:46'),
(8, '0900000000', '加麵', '未使用', '2026-01-15', '2025-10-15 06:10:28', '2025-10-15 00:10:28'),
(9, '0933333333', '完善個人資料', '已使用', '2025-11-14', '2025-10-15 06:47:21', '2025-10-15 06:47:21'),
(10, '0933333333', '首次入會', '已使用', '2025-11-14', '2025-10-15 06:47:27', '2025-10-15 06:47:27'),
(26, '0933333333', '拉麵套餐', '未使用', '2026-01-16', '2025-10-16 05:23:55', '2025-10-15 23:23:55'),
(27, '0933333333', '加麵', '未使用', '2026-01-17', '2025-10-17 04:28:02', '2025-10-16 22:28:02'),
(28, '0933333333', '加麵', '未使用', '2026-01-20', '2025-10-20 04:59:29', '2025-10-19 22:59:29'),
(29, '0933333333', '加麵', '未使用', '2026-01-20', '2025-10-20 08:34:50', '2025-10-20 02:34:50'),
(30, '0900000000', '生日優惠', '已使用', '2025-11-29', '2025-10-30 05:09:27', '2025-10-30 05:09:27'),
(31, '0901123123', '完善個人資料', '已使用', '2025-11-30', '2025-10-31 00:53:23', '2025-10-31 00:53:23'),
(32, '0933333333', '加麵', '已使用', '2026-02-03', '2025-11-03 08:21:54', '2025-11-03 01:21:54'),
(33, '0933333333', '溏心蛋', '已使用', '2026-02-03', '2025-11-03 09:42:19', '2025-11-03 02:42:19'),
(34, '0909090909', '完善個人資料', '已使用', '2025-12-14', '2025-11-14 02:40:50', '2025-11-14 02:40:50'),
(35, '0909090909', '首次入會', '已使用', '2025-12-14', '2025-11-14 05:01:52', '2025-11-14 05:01:52'),
(36, '0909090909', '生日優惠', '已使用', '2025-12-14', '2025-11-14 05:30:22', '2025-11-14 05:30:22'),
(37, '0901000000', '首次入會', '已使用', '2025-12-14', '2025-11-14 05:35:58', '2025-11-14 05:35:58'),
(38, '0901000000', '完善個人資料', '已使用', '2025-12-14', '2025-11-14 11:42:25', '2025-11-14 11:42:25'),
(39, '0901000000', '生日優惠', '已使用', '2025-12-14', '2025-11-14 12:13:16', '2025-11-14 12:13:16'),
(40, '0901000000', '加麵', '已使用', '2026-02-14', '2025-11-14 12:40:16', '2025-11-14 05:40:16'),
(41, '0901000000', '溏心蛋', '已使用', '2026-02-14', '2025-11-14 13:16:29', '2025-11-14 06:16:29'),
(42, '0901000000', '溏心蛋', '已使用', '2026-02-14', '2025-11-14 17:35:09', '2025-11-14 10:35:09'),
(43, '0933333333', '生日優惠', '已使用', '2025-12-15', '2025-11-14 19:02:32', '2025-11-14 19:02:32'),
(44, '0901000000', '溏心蛋', '未使用', '2026-02-18', '2025-11-18 10:21:39', '2025-11-18 03:21:39');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `ramen_coupons`
--
ALTER TABLE `ramen_coupons`
  ADD PRIMARY KEY (`優惠券編號`),
  ADD KEY `fk_優惠券會員` (`電話`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `ramen_coupons`
--
ALTER TABLE `ramen_coupons`
  MODIFY `優惠券編號` int(11) NOT NULL AUTO_INCREMENT COMMENT '優惠券編號', AUTO_INCREMENT=45;

--
-- 已傾印資料表的限制式
--

--
-- 資料表的限制式 `ramen_coupons`
--
ALTER TABLE `ramen_coupons`
  ADD CONSTRAINT `fk_優惠券會員` FOREIGN KEY (`電話`) REFERENCES `ramen_members` (`電話`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
